Workspace/test_cases/vertificating/sineWaveDampingLong03/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
libs ("libvelocityOutletNSCBC.so" "libwaveTransmision.so" "libpressureOutletNSCBC.so" "libpressureInletNSCBC.so" "libtemperatureOutletNSCBC.so");
application     rhoPimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.0192;

deltaT          2e-6;

writeControl    runTime;

writeInterval   0.0002;

purgeWrite      0;

writeFormat     ascii; // binary;

writePrecision  16;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  no;

maxCo           0.3;

maxDeltaT       1;


functions
{

    #includeFunc mag(U)
    fieldAverage
    {
        type            fieldAverage;
        libs            (fieldFunctionObjects);
        writeControl    writeTime;
        fields
        (
            U
            {
                mean        on;
                prime2Mean  off;
                base        time;
            }

            p
            {
                mean        on;
                prime2Mean  off;
                base        time;
            }

        );
    }
    probes
    {
	type           probes;
	libs           (sampling);
        name           probes;
	writeControl   timeStep;
	writeInterval  1;
        fields         (p U);
        interpolationScheme  cell;
	probeLocations
	(
		(0 0.0 0.0)
                (1 0.0 0.0)
                (2 0.0 0.0)
		(3 0.0 0.0)
		(4 0.0 0.0)
		(5 0.0 0.0)
		(6 0.0 0.0)
		(7 0.0 0.0)
                (8 0.0 0.0)
                (9 0.0 0.0)
		(10 0.0 0.0)
	);
	
    }
}

// ************************************************************************* //
